Информационная_база_17/src/Documents/Трудозатраты/Трудозатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Трудозатраты</name>
  <registerRecords>AccumulationRegister.ДоходыИсполнителей</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияТрудозатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплатыЗаказчиком</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплатыИсполнителям</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>DocumentRef.Задачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплата</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Информационная_база_17/src/Documents/Трудозатраты/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Количество = Работы.Итог("Количество");
	Сумма = Работы.Итог("Сумма");
	СуммаОплатыЗаказчиком = 0;
	СуммаОплатыИсполнителям = 0;
	Для Каждого СтрокаТЧ Из Оплата Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Дата) Тогда
			Если СтрокаТЧ.Сумма < 0 Тогда
				СуммаОплатыЗаказчиком = СуммаОплатыЗаказчиком - СтрокаТЧ.Сумма;
			ИначеЕсли Не СтрокаТЧ.Исполнитель.Пустая() Тогда
				СуммаОплатыИсполнителям = СуммаОплатыИсполнителям + СтрокаТЧ.Сумма;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Оплата.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ДоходыИсполнителей.Записывать = Истина;
	Для Каждого СтрокаОплаты Из Оплата Цикл
		Если СтрокаОплаты.Дата = '00010101' ИЛИ СтрокаОплаты.Сумма = 0 ИЛИ СтрокаОплаты.Исполнитель.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		Движение = Движения.ДоходыИсполнителей.Добавить();
		Движение.Период = СтрокаОплаты.Дата;
		Движение.Организация = Организация;
		Движение.Исполнитель = СтрокаОплаты.Исполнитель;
		Движение.Заказчик = Заказчик;
		Движение.Сумма = СтрокаОплаты.Сумма;
	КонецЦикла;
	
КонецПроцедуры
